app/controllers/galleries_controller.rb

    def index
        @gallery = Gallery.sort
        @galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries" ORDER BY galleries.position ASC