app/views/public/_menu.html.erb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."visible" = ? ORDER BY "galleries"."id" DESC LIMIT ?  [["visible", true], ["LIMIT", 10]]
---
                    <ul class="dropdown-menu">
                        <% gallery_menu = Gallery.where(:visible => true).last(10) %>

SELECT  "categories".* FROM "categories" WHERE "categories"."visible" = ? ORDER BY "categories"."id" DESC LIMIT ?  [["visible", true], ["LIMIT", 10]]
---
                    <ul class="dropdown-menu">
                        <% category_menu = Category.where(:visible => true).last(10) %>