app/views/public/galleries.html.erb

                <div class="row" style="margin-top: 20px;">
                    <% @gallery.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."gallery_id" = ?  [["gallery_id", 1]]