app/views/public/page.html.erb

        </div>
        <% @page.articles.visible.sort.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."page_id" = ? AND "articles"."visible" = ?  [["page_id", 1], ["visible", true]]